

const cats=[{CategoryName:"所有英雄",heroes:Array}
,{CategoryName:"战士",heroes:Array}
,{CategoryName:"法师",heroes:Array}
,{CategoryName:"刺客",heroes:Array}
,{CategoryName:"坦克",heroes:Array}
,{CategoryName:"射手",heroes:Array}
,{CategoryName:"辅助",heroes:Array}]
const all=["黑暗之女","狂战士","正义巨像","卡牌大师","德邦总管","无畏战车","诡术妖姬","猩红收割者","末日使者","正义天使","无极剑圣","牛头酋长","符文法师","亡灵战神","战争女神","众星之子","迅捷斥候","麦林炮手","祖安怒兽","雪原双子","赏金猎人","寒冰射手","蛮族之王","武器大师","堕落天使","时光守护者","炼金术士","痛苦之拥","瘟疫之源","死亡颂唱者","虚空恐惧","殇之木乃伊","披甲龙龟","冰晶凤凰","恶魔小丑","祖安狂人","琴瑟仙女","虚空行者","刀锋舞者","风暴之怒","海洋之灾","英勇投弹手","天启者","瓦洛兰之盾","邪恶小法师","巨魔之王","诺克萨斯统领","皮城女警","蒸汽机器人","熔岩巨兽","不祥之刃","永恒梦魇","扭曲树精","荒漠屠夫","德玛西亚皇子","蜘蛛女皇","发条魔灵","齐天大圣","复仇焰魂","盲僧","暗夜猎手","机械公敌","魔蛇之拥","水晶先锋","大发明家","沙漠死神","狂野女猎手","兽灵行者","圣锤之毅","酒桶","不屈之枪","探险家","铁铠冥魂","牧魂人","离群之刺","狂暴之心","德玛西亚之力","曙光女神","虚空先知","刀锋之影","放逐之刃","深渊巨口","暮光之眼","光辉女郎","远古巫灵","龙血武姬","九尾妖狐","法外狂徒","潮汐海灵","雷霆咆哮","傲之追猎者","惩戒之箭","深海泰坦","机械先驱","北地之怒","无双剑姬","爆破鬼才","仙灵女巫","荣耀行刑官","战争之影","虚空掠夺者","诺克萨斯之手","未来守护者","冰霜女巫","皎月女神","德玛西亚之翼","暗黑元首","铸星龙王","影流之镰","暮光星灵","荆棘之兴","虚空之女","迷失之牙","生化魔人","疾风剑豪","虚空之眼","岩雀","青钢影","弗雷尔卓德之心","戏命师","永猎双子","暴走萝莉","河流之王","涤魂圣枪","圣枪游侠","影流之主","暴怒骑士","时间刺客","元素女皇","皮城执法官","暗裔剑魔","唤潮鲛姬","沙漠皇帝","魔法猫咪","魂锁典狱长","海兽祭司","虚空遁地兽","翠神","复仇之矛","星界游神","幻翎","逆羽","山隐之焰","解脱者","万花通灵","残月之肃","血港鬼影","腕豪"]
const all2=all.map(x=>{
    return{
    name:x
    }
    })
const fighter=["狂战士","德邦总管","无畏战车","正义天使","无极剑圣","符文法师","亡灵战神","祖安怒兽","雪原双子","蛮族之王","武器大师","炼金术士","披甲龙龟","祖安狂人","刀锋舞者","海洋之灾","巨魔之王","诺克萨斯统领","蒸汽机器人","熔岩巨兽","永恒梦魇","荒漠屠夫","德玛西亚皇子","蜘蛛女皇","齐天大圣","盲僧","机械公敌","水晶先锋","沙漠死神","兽灵行者","圣锤之毅","酒桶","不屈之枪","铁铠冥魂","牧魂人","德玛西亚之力","放逐之刃","龙血武姬","潮汐海灵","雷霆咆哮","傲之追猎者","深海泰坦","北地之怒","无双剑姬","战争之影","诺克萨斯之手","皎月女神","影流之镰","迷失之牙","生化魔人","疾风剑豪","青钢影","暴怒骑士","时间刺客","元素女皇","皮城执法官","暗裔剑魔","海兽祭司","虚空遁地兽","山隐之焰","腕豪"]
const fighter2=fighter.map(x=>{
return{
name:x
}
})
const mage=["黑暗之女","正义巨像","卡牌大师","诡术妖姬","猩红收割者","末日使者","符文法师","众星之子","堕落天使","时光守护者","痛苦之拥","死亡颂唱者","虚空恐惧","殇之木乃伊","冰晶凤凰","琴瑟仙女","虚空行者","风暴之怒","天启者","邪恶小法师","诺克萨斯统领","不祥之刃","扭曲树精","蜘蛛女皇","发条魔灵","复仇焰魂","魔蛇之拥","大发明家","狂野女猎手","探险家","深渊巨口","光辉女郎","远古巫灵","惩戒之箭","机械先驱","爆破鬼才","仙灵女巫","冰霜女巫","暗黑元首","铸星龙王","暮光星灵","荆棘之兴","虚空之眼","岩雀","戏命师","唤潮鲛姬","魔法猫咪","翠神","星界游神","万花通灵"]
const mage2=mage.map(x=>{
return{
name:x
}
})
const assassin=["德邦总管","诡术妖姬","无极剑圣","迅捷斥候","麦林炮手","蛮族之王","武器大师","痛苦之拥","瘟疫之源","恶魔小丑","虚空行者","刀锋舞者","不祥之刃","永恒梦魇","盲僧","暗夜猎手","狂野女猎手","不屈之枪","离群之刺","虚空先知","刀锋之影","放逐之刃","九尾妖狐","潮汐海灵","傲之追猎者","无双剑姬","虚空掠夺者","德玛西亚之翼","影流之镰","疾风剑豪","影流之主","时间刺客","元素女皇","皮城执法官","解脱者","血港鬼影"]
const assassin2=assassin.map(x=>{
return{
name:x
}
})
const tank=["狂战士","正义巨像","无畏战车","牛头酋长","亡灵战神","祖安怒兽","雪原双子","炼金术士","虚空恐惧","殇之木乃伊","披甲龙龟","祖安狂人","巨魔之王","蒸汽机器人","熔岩巨兽","扭曲树精","荒漠屠夫","德玛西亚皇子","齐天大圣","水晶先锋","沙漠死神","兽灵行者","圣锤之毅","牧魂人","德玛西亚之力","曙光女神","暮光之眼","龙血武姬","雷霆咆哮","深海泰坦","北地之怒","战争之影","诺克萨斯之手","迷失之牙","生化魔人","青钢影","暴怒骑士","暗裔剑魔","海兽祭司","山隐之焰","腕豪"]
const tank2=tank.map(x=>{
return{
name:x
}
})
const marksman=["战争女神","迅捷斥候","麦林炮手","赏金猎人","寒冰射手","瘟疫之源","英勇投弹手","皮城女警","暗夜猎手","探险家","深渊巨口","法外狂徒","惩戒之箭","荣耀行刑官","德玛西亚之翼","虚空之女","戏命师","永猎双子","暴走萝莉","涤魂圣枪","圣枪游侠","复仇之矛","逆羽","残月之肃"]
const marksman2=marksman.map(x=>{
return{
name:x
}
})
const support=["末日使者","正义天使","牛头酋长","众星之子","寒冰射手","堕落天使","时光守护者","冰晶凤凰","琴瑟仙女","风暴之怒","天启者","发条魔灵","大发明家","曙光女神","光辉女郎","仙灵女巫","暗黑元首","暮光星灵","荆棘之兴","岩雀","涤魂圣枪","唤潮鲛姬","魔法猫咪","翠神","星界游神","幻翎","万花通灵"]
const support2=support.map(x=>{
return{
name:x
}
})
cats[0].heroes=all2
cats[1].heroes=fighter2
cats[2].heroes=mage2
cats[3].heroes=assassin2
cats[4].heroes=tank2
cats[5].heroes=marksman2
cats[6].heroes=support2

module.exports=cats


